ХМНПФ_Общее/Enums/ХМ_ЗагрузкаКаспер_ТипЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_ЗагрузкаКаспер_ТипЗагрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаПоПравиламОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаПоЗапросу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаСКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПропуститьЗагрузку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцедурнаяЗагрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УниверсальнаяЗагрузкаВРегистр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/ХМ_ЕжедневнаяЗагрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_ЕжедневнаяЗагрузка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыполняетсяОбмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕжемесячнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПотоковаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_МенеджерЗагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НачалоПрошлойЗагрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НеПерезагружатьНайденные</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИмяТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПредставлениеТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗагружатьИзмененияСДаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗагрузкаСервер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИспользоватьДопУсловие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТолькоЗапросы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОбновитьЗагрузку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаИзменений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗагрузкаКаспер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗагрузкаКлиент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗагрузкаНеСвязанных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УведомлятьПриОшибке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Documents/ХМ_МенеджерЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_МенеджерЗагрузки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагружатьИзмененияСДаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачалоПрошлойЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьДопУсловие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеПерезагружатьНайденные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТолькоЗапросы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбновитьЗагрузку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИДКаспер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредставлениеТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаКаспер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаСервер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаНеСвязанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЗагрузкиКаспер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХМ_ЗагрузкаКаспер_ТипЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЗагрузкиКлиент</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХМ_ЗагрузкаКаспер_ТипЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЗагрузкиСервер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХМ_ЗагрузкаКаспер_ТипЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтрокаТаблицыСервер_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТабличноеПолеВидыОбъектов_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛогОшибок_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПараметрыЗагрузки_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПравилаЗагрузкиКаспер_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПравилаЗагрузкиКлиент_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПравилаЗагрузкиСервер_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/CommonModules/ХМ_ЗагрузкаТЗ_Клиент/Ext/Module.bsl
Функция СтруктураПоискаСтрокиТаблицы() Экспорт
	Возврат Новый Структура("ИмяТаблицы,ПредставлениеТаблицы");
КонецФункции

&Вместо("ВыполнитьОбмен")
Функция ХМ_ВыполнитьОбмен(Режим = Неопределено,ТипЗагрузки = Неопределено,ХМ_ЕжедневнаяЗагрузка = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;
	
	Если ХМ_ЕжедневнаяЗагрузка = Неопределено Тогда
		ХМ_ЕжедневнаяЗагрузка = ПолучитьЕЖ(ТипЗагрузки);
	КонецЕсли;
	Попытка
	Если ХМ_ЕжедневнаяЗагрузка.ВыполняетсяОбмен И Не ДополнительныеПараметры.Свойство("ВыполнитьДозагрузку") Тогда
		ВызватьИсключение "Обмен уже запущен";	
	КонецЕсли;
	ХМ_ЕжедневнаяЗагрузка_Объект = ХМ_ЕжедневнаяЗагрузка.ПолучитьОбъект();
	ХМ_ЕжедневнаяЗагрузка_Объект.ВыполняетсяОбмен  = Истина;
	ХМ_ЕжедневнаяЗагрузка_Объект.Записать();                              
	Если Ложь Тогда ХМ_ЕжедневнаяЗагрузка_Объект = Документы.ХМ_ЕжедневнаяЗагрузка.СоздатьДокумент(); КонецЕсли;

	ПрерватьПоОшибке = Ложь;
	ХМ_МенеджерЗагрузки = Документы.ХМ_МенеджерЗагрузки.СоздатьДокумент();
	Начало = ТекущаяДата();
	ОбщийЛогОшибок = "";

	Для НомерСтроки = 0 По ХМ_ЕжедневнаяЗагрузка_Объект.ХМ_МенеджерЗагрузки.Количество() - 1 Цикл

		СтрокаПланировщик = ХМ_ЕжедневнаяЗагрузка_Объект.ХМ_МенеджерЗагрузки[НомерСтроки];

		Если ДополнительныеПараметры.Свойство("ЗапускИзФоновогоЗадания") Тогда
			ПроцентОбработки = 100*НомерСтроки/ХМ_ЕжедневнаяЗагрузка_Объект.ХМ_МенеджерЗагрузки.Количество();	
			ТекстСопровождения = "Выполняется обмен для "+СтрокаПланировщик.ПредставлениеТаблицы;
		    ДлительныеОперации.СообщитьПрогресс(ПроцентОбработки,ТекстСопровождения); 
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПланировщик.Начало) Тогда
			СтрокаПланировщик.Начало = Начало;
		КонецЕсли;
		
		Если СтрокаПланировщик.Результат = Истина Тогда
			Начало = Мин(Начало,СтрокаПланировщик.Начало);
			Продолжить;	
		КонецЕсли;
		
		ПараметрыЗагрузки = СтрокаПланировщик.ПараметрыЗагрузки_ХЗ.Получить();
		Если ПараметрыЗагрузки = Неопределено Тогда
			ПараметрыЗагрузки = Новый Структура();
		КонецЕсли;
		
		Если ПараметрыЗагрузки.Свойство("ПроверитьРезультатОтносительноСтрокиЗагрузки") Тогда
			СтрокаПроверкиРезультата = ХМ_ЕжедневнаяЗагрузка_Объект.ХМ_МенеджерЗагрузки[НомерСтроки + ПараметрыЗагрузки.ПроверитьРезультатОтносительноСтрокиЗагрузки];
			Если СтрокаПроверкиРезультата.Результат = Ложь Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ДатаИзменений") Тогда
			СтрокаПланировщик.НачалоПрошлойЗагрузки = ДополнительныеПараметры.ДатаИзменений;
			СтрокаПланировщик.ДатаИзменений = ДополнительныеПараметры.ДатаИзменений;
		КонецЕсли;
	
		Если СтрокаПланировщик.ЗагрузкаКаспер = Истина Тогда
			Начало = Мин(Начало,СтрокаПланировщик.Начало);
		КонецЕсли;
		Если ХМ_ЕжедневнаяЗагрузка_Объект.ПотоковаяЗагрузка = Истина Тогда
			ДополнительныеПараметры.Вставить("ПотоковаяЗагрузка");
			ЗаполнитьЗначенияСвойств(ХМ_МенеджерЗагрузки,СтрокаПланировщик);
			ХМ_МенеджерЗагрузки.ВыполнитьЗагрузку(,ДополнительныеПараметры);
			ЗаполнитьЗначенияСвойств(СтрокаПланировщик,ХМ_МенеджерЗагрузки);
			ХМ_ЕжедневнаяЗагрузка_Объект.Записать();
			Продолжить;
		КонецЕсли;
		Если (Режим = Неопределено ИЛИ Режим = "ЗагрузкаКаспер") И Не СтрокаПланировщик.ЗагрузкаКаспер Тогда
			ЗаполнитьЗначенияСвойств(ХМ_МенеджерЗагрузки,СтрокаПланировщик);
			ХМ_МенеджерЗагрузки.ВыполнитьЗагрузку("ЗагрузкаКаспер",ДополнительныеПараметры);
			ЗаполнитьЗначенияСвойств(СтрокаПланировщик,ХМ_МенеджерЗагрузки);
			ХМ_ЕжедневнаяЗагрузка_Объект.Записать();
			Если СтрокаПланировщик.Результат = Ложь И СтрокаПланировщик.ЗагрузкаКаспер = Ложь Тогда
				ОбщийЛогОшибок = ОбщийЛогОшибок + Символы.ПС + Символы.ПС + "Ошибка загрузки каспер "+СтрокаПланировщик.ПредставлениеТаблицы + " ("+СтрокаПланировщик.ИмяТаблицы+"), по причине:"+ Символы.ПС + Документы.ХМ_ЕжедневнаяЗагрузка.ПолучитьЛогПоСтроке(СтрокаПланировщик.ЛогОшибок_ХЗ)
			КонецЕсли;
		КонецЕсли;
		Если (Режим = Неопределено ИЛИ Режим = "ЗагрузкаСервер") И СтрокаПланировщик.ЗагрузкаКаспер И Не СтрокаПланировщик.ЗагрузкаСервер Тогда
			ЗаполнитьЗначенияСвойств(ХМ_МенеджерЗагрузки,СтрокаПланировщик);
			ХМ_МенеджерЗагрузки.ВыполнитьЗагрузку("ЗагрузкаСервер",ДополнительныеПараметры);
			ЗаполнитьЗначенияСвойств(СтрокаПланировщик,ХМ_МенеджерЗагрузки);
			ХМ_ЕжедневнаяЗагрузка_Объект.Записать();
			Если СтрокаПланировщик.Результат = Ложь И СтрокаПланировщик.ЗагрузкаСервер = Ложь Тогда
				ОбщийЛогОшибок = ОбщийЛогОшибок + Символы.ПС + Символы.ПС + "Ошибка загрузки клиента "+СтрокаПланировщик.ПредставлениеТаблицы + " ("+СтрокаПланировщик.ИмяТаблицы+"), по причине:"+ Символы.ПС + Документы.ХМ_ЕжедневнаяЗагрузка.ПолучитьЛогПоСтроке(СтрокаПланировщик.ЛогОшибок_ХЗ)
			КонецЕсли;
		КонецЕсли;
		Если СтрокаПланировщик.Результат = Ложь И ПрерватьПоОшибке = Истина Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ХМ_ЕжедневнаяЗагрузка_Объект.Дата = Начало;
	Если (Режим = Неопределено ИЛИ Режим = "ЗагрузкаСервер")  Тогда
		ХМ_ЕжедневнаяЗагрузка_Объект.Проведен = Истина;
	КонецЕсли;
	Если ХМ_ЕжедневнаяЗагрузка_Объект.ЕжемесячнаяЗагрузка = Ложь Тогда
		ХМ_ЕжедневнаяЗагрузка_Объект.ВыполняетсяОбмен  = Ложь;
	Иначе
		Для каждого СтрокаРезультат Из ХМ_ЕжедневнаяЗагрузка_Объект.ХМ_МенеджерЗагрузки Цикл
			Если СтрокаРезультат.Результат = Ложь Тогда
				ХМ_ЕжедневнаяЗагрузка_Объект.ВыполняетсяОбмен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ДополнительныеПараметры.Свойство("ТолькоСверкаДанных") Тогда
		ХМ_ЕжедневнаяЗагрузка_Объект.ТипЗагрузки = ХМ_ЕжедневнаяЗагрузка_Объект.ТипЗагрузки + "_СД";
	КонецЕсли;

	ХМ_ЕжедневнаяЗагрузка_Объект.Записать(); 
	ХМ_ЕжедневнаяЗагрузка = ХМ_ЕжедневнаяЗагрузка_Объект.Ссылка;
	Если ЗначениеЗаполнено(ОбщийЛогОшибок) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщийЛогОшибок;
		Сообщение.Сообщить();
	КонецЕсли;

	СтрокИБ = СтрокаСоединенияИнформационнойБазы();

	Если ЗначениеЗаполнено(ОбщийЛогОшибок) И ХМ_ЕжедневнаяЗагрузка_Объект.УведомлятьПриОшибке.Количество() > 0 Тогда
		ХМ_ПрочиеПроцедурыВызовСервера.ОтправитьСистемноеСообщениеНаПочту(""+СтрокИБ + ": Ошибка ежедневной загрузки "+ХМ_ЕжедневнаяЗагрузка_Объект.ТипЗагрузки,
			ОбщийЛогОшибок,ХМ_ЕжедневнаяЗагрузка_Объект.УведомлятьПриОшибке.Выгрузить().ВыгрузитьКолонку("Пользователь"));		
	КонецЕсли;
	Исключение
		Если ХМ_ЕжедневнаяЗагрузка.УведомлятьПриОшибке.Количество() > 0 Тогда
			
			ХМ_ПрочиеПроцедурыВызовСервера.ОтправитьСистемноеСообщениеНаПочту(""+СтрокИБ + ": Ошибка ежедневной загрузки "+ХМ_ЕжедневнаяЗагрузка.ТипЗагрузки,
				ОписаниеОшибки(),ХМ_ЕжедневнаяЗагрузка.УведомлятьПриОшибке.Выгрузить().ВыгрузитьКолонку("Пользователь"));		
		КонецЕсли;
	КонецПопытки;
	Возврат ХМ_ЕжедневнаяЗагрузка; 
КонецФункции

Функция ЗаполнитьМЗ(МЗ, СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры)
	
	Если Не ДополнительныеПараметры.Свойство("СКД_НастроитьИзвлечениеДанных") Тогда
		ЗаполнитьЗначенияСвойств(МЗ,СтрокаТаблицы);
		ЗаполнитьЗначенияСвойств(МЗ,ПараметрыЗагрузки);
		ЗаполнитьЗначенияСвойств(МЗ,ДополнительныеПараметры); 
		МЗ.СтрокаТаблицыСервер_ХЗ = Новый ХранилищеЗначения(СтрокаТаблицы);
		МЗ.ПараметрыЗагрузки_ХЗ = Новый ХранилищеЗначения(ПараметрыЗагрузки);
		МЗ.ПравилаЗагрузкиКаспер_ХЗ = Новый ХранилищеЗначения(ПравилаЗагрузкиКаспер);
		МЗ.ПравилаЗагрузкиКлиент_ХЗ = Новый ХранилищеЗначения(ПравилаЗагрузкиКлиент);
		МЗ.ПравилаЗагрузкиСервер_ХЗ = Новый ХранилищеЗначения(ПравилаЗагрузкиСервер);
	Иначе
		ЗаполнитьЗначенияСвойств(МЗ,ПараметрыЗагрузки);
		ЗаполнитьЗначенияСвойств(МЗ,ДополнительныеПараметры); 
		МЗ_ПравилаЗагрузкиКаспер = МЗ.ПравилаЗагрузкиКаспер_ХЗ.Получить();
		Если МЗ_ПравилаЗагрузкиКаспер = Неопределено Тогда 
			МЗ_ПравилаЗагрузкиКаспер = Новый Структура();
		КонецЕсли; 
		Для каждого СтрокаПравил Из ПравилаЗагрузкиКаспер Цикл
			МЗ_ПравилаЗагрузкиКаспер.Вставить(СтрокаПравил.Ключ, СтрокаПравил.Значение);
		КонецЦикла;
		МЗ.ПравилаЗагрузкиКаспер_ХЗ = Новый ХранилищеЗначения(МЗ_ПравилаЗагрузкиКаспер);
		МЗ_ПараметрыЗагрузки = МЗ.ПараметрыЗагрузки_ХЗ.Получить();
		Если МЗ_ПараметрыЗагрузки = Неопределено Тогда 
			МЗ_ПараметрыЗагрузки = Новый Структура();
		КонецЕсли; 
		Для каждого СтрокаПравил Из ПараметрыЗагрузки Цикл
			МЗ_ПараметрыЗагрузки.Вставить(СтрокаПравил.Ключ, СтрокаПравил.Значение);
		КонецЦикла;
		МЗ.ПараметрыЗагрузки_ХЗ = Новый ХранилищеЗначения(МЗ_ПараметрыЗагрузки);
	КонецЕсли;

КонецФункции

&Вместо("ЗагрузитьДокумент")
Функция ХМЗагрузитьДокумент(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок)
	
	РезультатЗагрузки = Новый Структура("Результат,ЗагрузкаКаспер,ЗагрузкаКлиент,ЗагрузкаСервер",Ложь,Ложь,Ложь,Ложь);

	Если НЕ ПараметрыЗагрузки.Свойство("Режим") Тогда 
		ПараметрыЗагрузки.Вставить("Режим");	
	КонецЕсли;
 	Если НЕ ПараметрыЗагрузки.Свойство("ТолькоЗапросы") Тогда 
		ПараметрыЗагрузки.Вставить("ТолькоЗапросы",Ложь);	
	КонецЕсли;
	
	ВыполненоЗаполнениеМЗ = Ложь;
	Если ДополнительныеПараметры.Свойство("СоздатьМЗ") Тогда
		МЗ = Документы.ХМ_МенеджерЗагрузки.СоздатьДокумент();
		
		ЗаполнитьМЗ(МЗ,СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры);
		
		МЗ.УстановитьНовыйНомер();
		МЗ.Дата = ТекущаяДата();
		МЗ.Записать();
		РезультатЗагрузки.Вставить("МЗ",МЗ.Ссылка);
		ВыполненоЗаполнениеМЗ = Истина;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОбновитьВЕЖ") Тогда
		ЕЖ_Ссылка = ХМ_ЗагрузкаТЗ_Клиент.ПолучитьЕЖ(ДополнительныеПараметры.ТипЗагрузки);
		ЕЖ = ЕЖ_Ссылка.ПолучитьОбъект(); 
		СтруктураПоиска = СтруктураПоискаСтрокиТаблицы();
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТаблицы);

		МЗ_Строки = ЕЖ.ХМ_МенеджерЗагрузки.НайтиСтроки(СтруктураПоиска);
		Для каждого МЗ Из МЗ_Строки Цикл
			ЗаполнитьМЗ(МЗ,СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры);
		КонецЦикла;

		ЕЖ.Записать();
		РезультатЗагрузки.Вставить("ЕЖ",ЕЖ.Ссылка);
		ВыполненоЗаполнениеМЗ = Истина;
	КонецЕсли;

	Если ДополнительныеПараметры.Свойство("ДобавитьВЕЖ") Тогда
		ЕЖ_Ссылка = ХМ_ЗагрузкаТЗ_Клиент.ПолучитьЕЖ(ДополнительныеПараметры.ТипЗагрузки);
		ЕЖ = ЕЖ_Ссылка.ПолучитьОбъект();
		
		МЗ = ЕЖ.ХМ_МенеджерЗагрузки.Добавить(); 

		ЗаполнитьМЗ(МЗ,СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры);

		ЕЖ.Записать();
		РезультатЗагрузки.Вставить("ЕЖ",ЕЖ.Ссылка);
		ВыполненоЗаполнениеМЗ = Истина;
	КонецЕсли;
		

	Если ВыполненоЗаполнениеМЗ = Истина Тогда
		Возврат РезультатЗагрузки;
	КонецЕсли;
	//    

	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;
 	Если (ДополнительныеПараметры.Свойство("С1_ВернутьРезультатыЗапроса") ИЛИ ДополнительныеПараметры.Свойство("С1_ВернутьТаблицы1С")) И НЕ ДополнительныеПараметры.Свойство("С1_РезультатыЗапроса") Тогда
		ДополнительныеПараметры.Вставить("С1_РезультатыЗапроса",Новый Массив);	
	КонецЕсли;
	ДополнительныеПараметры.Вставить("СтрокаТаблицы",СтрокаТаблицы);        

	Попытка
		РезультатЗагрузки.ЗагрузкаКаспер = ЗагрузкаКаспер_Выполнить(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ДополнительныеПараметры, ЛогОшибок);
	Исключение     
		ЛогОшибок.Добавить(ОписаниеОшибки());
		РезультатЗагрузки.ЗагрузкаКаспер = Ложь;
	КонецПопытки;         
	
	Если РезультатЗагрузки.ЗагрузкаКаспер = Ложь Тогда
		РезультатЗагрузки.Результат = Ложь;
		Возврат ПередВозвратомРезультата(СтрокаТаблицы,РезультатЗагрузки,ДополнительныеПараметры, ПравилаЗагрузкиКаспер);
	ИначеЕсли ПараметрыЗагрузки.Режим = "ЗагрузкаКаспер" ИЛИ ПараметрыЗагрузки.ТолькоЗапросы  Тогда
		РезультатЗагрузки.Результат = РезультатЗагрузки.ЗагрузкаКаспер;
		Возврат ПередВозвратомРезультата(СтрокаТаблицы,РезультатЗагрузки,ДополнительныеПараметры, ПравилаЗагрузкиКаспер);
	КонецЕсли;


	Если ПараметрыЗагрузки.Режим = НЕОПРЕДЕЛЕНО ИЛИ ПараметрыЗагрузки.Режим = "ЗагрузкаСервер" ИЛИ ПараметрыЗагрузки.Режим = "ЗагрузкаКасперСервер" Тогда
		РезультатЗагрузки.ЗагрузкаКлиент = Истина;

		Попытка
			ЗагрузкаКлиент_Выполнить(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ДополнительныеПараметры, ЛогОшибок, РезультатЗагрузки);
		Исключение     
			ЛогОшибок.Добавить(ОписаниеОшибки());
			РезультатЗагрузки.ЗагрузкаКлиент = Ложь;
		КонецПопытки;         

		Если РезультатЗагрузки.ЗагрузкаКлиент = Ложь Тогда
			Возврат ПередВозвратомРезультата(СтрокаТаблицы,РезультатЗагрузки,ДополнительныеПараметры,ПравилаЗагрузкиКаспер,ПравилаЗагрузкиКлиент);
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Режим = НЕОПРЕДЕЛЕНО ИЛИ ПараметрыЗагрузки.Режим = "ЗагрузкаСервер" Тогда
		Если ДополнительныеПараметры.Свойство("С1_ВернутьТаблицы1С") Тогда
			Если СтрокаТаблицы.ТипЗагрузкиКлиент = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
				Для каждого ГруппаПравилЗагрузки Из ПравилаЗагрузкиКлиент Цикл 
					Для каждого КЗ_СтруктураЗагрузкиКлиент Из ГруппаПравилЗагрузки.Значение Цикл
						СтруктураЗагрузкиКлиент = КЗ_СтруктураЗагрузкиКлиент.Значение;
						ДополнительныеПараметры.С1_РезультатыЗапроса.Добавить(Новый Структура("Имя, ТекстЗапроса, ТЗ",
						СтрокаТаблицы.ПредставлениеТаблицы +":"+ СтруктураЗагрузкиКлиент.МетаданныеЗначения_Имя + " (" + ПолучитьМетаТип_по_ТипОбъекта(СтрокаТаблицы.ТипОбъекта)+СтрокаТаблицы.ИмяТаблицы+")",СтруктураЗагрузкиКлиент.ТекстЗапроса,СтруктураЗагрузкиКлиент.ТЗ));
					КонецЦикла;
				КонецЦикла;
			ИначеЕсли СтрокаТаблицы.ТипЗагрузкиКлиент = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаСКД Тогда
				Для каждого СтруктураЗагрузкиКлиент Из ПравилаЗагрузкиКлиент Цикл 
					ДополнительныеПараметры.С1_РезультатыЗапроса.Добавить(Новый Структура("Имя, ТекстЗапроса, ТЗ",
					СтрокаТаблицы.ПредставлениеТаблицы +": "+ СтруктураЗагрузкиКлиент.Ключ,СтруктураЗагрузкиКлиент.Значение.ИмяОтчета + " ("+СтруктураЗагрузкиКлиент.Значение.ИмяВариантаОтчета+")",СтруктураЗагрузкиКлиент.Значение.ТЗ));
				КонецЦикла;
			ИначеЕсли СтрокаТаблицы.ТипЗагрузкиКлиент = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоЗапросу Тогда
				Для каждого СтруктураЗагрузкиКлиент Из ПравилаЗагрузкиКлиент Цикл 
					ДополнительныеПараметры.С1_РезультатыЗапроса.Добавить(Новый Структура("Имя, ТекстЗапроса, ТЗ",
					СтрокаТаблицы.ПредставлениеТаблицы +":"+ СтруктураЗагрузкиКлиент.Ключ,СтруктураЗагрузкиКлиент.Значение.ТекстЗапроса,СтруктураЗагрузкиКлиент.Значение.ТЗ));
 				КонецЦикла;
			КонецЕсли;
			РезультатЗагрузки.Результат = Истина;
			Возврат ПередВозвратомРезультата(СтрокаТаблицы,РезультатЗагрузки,ДополнительныеПараметры,ПравилаЗагрузкиКаспер,ПравилаЗагрузкиКлиент);
		КонецЕсли;                                                                                                  
		
		Попытка
			ЗагрузкаСервер_Выполнить(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок, РезультатЗагрузки);
		Исключение     
			ЛогОшибок.Добавить(ОписаниеОшибки());
			РезультатЗагрузки.ЗагрузкаСервер = Ложь;
			РезультатЗагрузки.Результат = Ложь;
		КонецПопытки;
		
		Если Не ПравилаЗагрузкиСервер = Неопределено Тогда
			Для каждого СтруктураЗагрузкиСервер Из ПравилаЗагрузкиСервер Цикл			
				СтрокаПравилСервер = СтруктураЗагрузкиСервер.Значение;
				Если СтрокаПравилСервер.Свойство("ТабличныйДокумент") Тогда
					Если НЕ ДополнительныеПараметры.Свойство("С1_РезультатыЗапроса") Тогда					
						ДополнительныеПараметры.Вставить("С1_РезультатыЗапроса",Новый Массив);					
					КонецЕсли;
					Если СтрокаТаблицы.ТипЗагрузкиСервер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ПроцедурнаяЗагрузка Тогда
						ДополнительныеПараметры.С1_РезультатыЗапроса.Добавить(Новый Структура("Имя, ТекстЗапроса, ТЗ",
						СтрокаТаблицы.ПредставлениеТаблицы +":"+ СтруктураЗагрузкиСервер.Ключ, СтрокаПравилСервер.ИмяТЗ + " ("+СтрокаПравилСервер.ИмяПроцедуры+")",СтрокаПравилСервер.ТабличныйДокумент));
					КонецЕсли;				
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	
		Возврат ПередВозвратомРезультата(СтрокаТаблицы,РезультатЗагрузки,ДополнительныеПараметры,ПравилаЗагрузкиКаспер,ПравилаЗагрузкиКлиент);
	КонецЕсли;

	Возврат ПередВозвратомРезультата(СтрокаТаблицы,РезультатЗагрузки,ДополнительныеПараметры,ПравилаЗагрузкиКаспер,ПравилаЗагрузкиКлиент);
КонецФункции

Функция ЗагрузкаКаспер_Выполнить(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ДополнительныеПараметры, ЛогОшибок)
	
	Перем РезультатЗагрузки, СтруктураЗапроса, ТЗ;
	Если СтрокаТаблицы.ТипЗагрузкиКаспер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
		Возврат ЗагрузкаКаспер_ВыполнитьПоПравилам(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ДополнительныеПараметры, ЛогОшибок);
	ИначеЕсли СтрокаТаблицы.ТипЗагрузкиКаспер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоЗапросу Тогда
		Возврат ЗагрузкаКаспер_ВыполнитьПоЗапросу(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ДополнительныеПараметры, ЛогОшибок);
	ИначеЕсли СтрокаТаблицы.ТипЗагрузкиКаспер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаСКД Тогда
        Возврат ЗагрузкаКаспер_ВыполнитьСКД(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ДополнительныеПараметры, ЛогОшибок);
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ЗагрузкаКаспер_ВыполнитьПоПравилам(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ДополнительныеПараметры, ЛогОшибок)
	
	Перем ЛогОшибок_ХЗ, ПервыйЗапрос, СтрокаЗапроса, СтруктураЗапроса, ТЗ, ХМ_ЗагрузкаДанных;
	
	ХМ_ЗагрузкаДанных = Обработки.ХМ_ЗагрузкаДанных.Создать();
	//ХМ_ЗагрузкаДанных.ИнициализацияВручную("\\192.168.0.253\обмен\Обработки\КЭШКонфигурации\"+КаталогТаблицы+"\");
	ХМ_ЗагрузкаДанных.ИнициализацияВручную(ПараметрыЗагрузки.КаталогОбработки);
	
	ПервыйЗапрос = Неопределено;
	РезультатЗагрузки = Истина;
	Для каждого СтрокаЗапроса Из ПравилаЗагрузкиКаспер Цикл
		
		Если ПараметрыЗагрузки.НаСервере Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ПараметрыЗагрузки.Режим = "ЗагрузкаСервер" ИЛИ ПараметрыЗагрузки.Режим = "ЗагрузкаКасперСервер" Тогда
			Продолжить;	
		КонецЕсли;
		
		СтруктураЗапроса = СтрокаЗапроса.Значение;	
		
		Если ПараметрыЗагрузки.ОбновитьЗагрузку ИЛИ СтруктураЗапроса.ПоДокументам = Истина Тогда
			ХМ_ЗагрузкаДанных.УдалитьДанные(СтруктураЗапроса.ТекстЗапроса);
		КонецЕсли;
		
		Попытка
			Если СтруктураЗапроса.ПоДокументам = Истина Тогда                                 
				ТЗ = ХМ_ЗагрузкаДанных.ЗагрузитьДанныеПоДокументам(СтруктураЗапроса.ТекстЗапроса,,ПервыйЗапрос.ВыгрузитьКолонку(СтруктураЗапроса.ПолеДокумента), ":Документ", ДополнительныеПараметры);
			Иначе
				ТЗ = ХМ_ЗагрузкаДанных.ЗагрузитьДанные(СтруктураЗапроса.ТекстЗапроса,,ДополнительныеПараметры);
			КонецЕсли;
		Исключение
			ЛогОшибок.Добавить(ОписаниеОшибки());
			ЛогОшибок_ХЗ = Новый ХранилищеЗначения(ЛогОшибок);
			РезультатЗагрузки = Ложь;
		КонецПопытки;
		
		Если ДополнительныеПараметры.Свойство("Каспер_ВернутьРезультатыЗапроса") Тогда
			Если ПервыйЗапрос = Неопределено Тогда
				ДополнительныеПараметры.Вставить("Каспер_РезультатыЗапроса",Новый Массив);	
			КонецЕсли;
			ДополнительныеПараметры.Каспер_РезультатыЗапроса.Добавить(Новый Структура("Имя, ТекстЗапроса, ТЗ",СтруктураЗапроса.Имя,СтруктураЗапроса.ТекстЗапроса,ТЗ));
		КонецЕсли;
		
		Если ПервыйЗапрос = Неопределено Тогда
			ПервыйЗапрос = ТЗ;	
		КонецЕсли;
		СтруктураЗапроса.Вставить("ТЗ",ТЗ);
		ТЗ = Неопределено;
	КонецЦикла;
	
	ПараметрыЗагрузки.Вставить("Таблица_ХМ_КасперСохраненныйРезультатЗапроса",ХМ_ЗагрузкаДанных.Таблица_ХМ_КасперСохраненныйРезультатЗапроса);

	Возврат РезультатЗагрузки;
КонецФункции

Функция ЗагрузкаКаспер_ВыполнитьПоЗапросу(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ДополнительныеПараметры, ЛогОшибок = Неопределено) Экспорт
	

	Перем ПолеОтбора, ТекстWhere, ХМ_Оракл;

	Если Не ПараметрыЗагрузки.Свойство("ACC_ID") Тогда
		ПараметрыЗагрузки.Вставить("ACC_ID",0);
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("РеквизитОтбора") Тогда
		ПараметрыЗагрузки.Вставить("РеквизитОтбора","OPER_ID");
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("PF_ID") Тогда
		ПараметрыЗагрузки.Вставить("PF_ID",0);
	КонецЕсли;

	Для каждого КЗ_СтруктураЗагрузкиКаспер Из ПравилаЗагрузкиКаспер Цикл 
		
		СтруктураЗагрузкиКаспер = КЗ_СтруктураЗагрузкиКаспер.Значение;
		
		Если СтруктураЗагрузкиКаспер.Свойство("ТЗ") И Не СтруктураЗагрузкиКаспер.ТЗ = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если Не СтруктураЗагрузкиКаспер.Свойство("Запрос") Тогда
			СтруктураЗагрузкиКаспер.Вставить("Запрос","");
		КонецЕсли;

		Если Не СтруктураЗагрузкиКаспер.Свойство("ТекстЗапроса") Тогда
			СтруктураЗагрузкиКаспер.Вставить("ТекстЗапроса","");
		КонецЕсли;


		Если Не ЗначениеЗаполнено(СтруктураЗагрузкиКаспер.ТекстЗапроса) Тогда
			Если НЕ ЗначениеЗаполнено(СтруктураЗагрузкиКаспер.Запрос) Тогда
				СтруктураЗагрузкиКаспер.Запрос = РегистрыСведений.ХМ_ЗагрузкаКасперV4.ПолучитьТекстЗапросаИзРегистраЗагрузки(СтрокаТаблицы.ИмяТаблицы,ПараметрыЗагрузки.PF_ID, Ложь);
			КонецЕсли;

			СтруктураЗагрузкиКаспер.ТекстЗапроса = СтруктураЗагрузкиКаспер.Запрос;

			ПоляОтбораЗаписей = хм_МеханизмыСверкиСервер.ПолучитьПоляОтбораЗаписей(СтрокаТаблицы, ПараметрыЗагрузки);
			
			Если ДополнительныеПараметры.Свойство("ПоляОтбораЗаписей") Тогда
				Для каждого КЗ Из ДополнительныеПараметры.ПоляОтбораЗаписей Цикл 
					ПоляОтбораЗаписей.Вставить(КЗ.Ключ,КЗ.Значение);	
				КонецЦикла;
			КонецЕсли;

			Для каждого ПолеОтбора Из ПоляОтбораЗаписей Цикл
				Если ТипЗнч(ПолеОтбора.Значение) = Тип("Дата") Тогда
					СтруктураЗагрузкиКаспер.ТекстЗапроса = СтрЗаменить(СтруктураЗагрузкиКаспер.ТекстЗапроса,"%"+ПолеОтбора.Ключ+"%",Формат(ПолеОтбора.Значение, "ДФ=""дд.ММ.гггг"""));
					СтруктураЗагрузкиКаспер.ТекстЗапроса = СтрЗаменить(СтруктураЗагрузкиКаспер.ТекстЗапроса,":"+ПолеОтбора.Ключ,"'"+Формат(ПолеОтбора.Значение, "ДФ=""дд.ММ.гггг""")+"'");
				Иначе
					СтруктураЗагрузкиКаспер.ТекстЗапроса = СтрЗаменить(СтруктураЗагрузкиКаспер.ТекстЗапроса,"%"+ПолеОтбора.Ключ+"%",ПолеОтбора.Значение);
					СтруктураЗагрузкиКаспер.ТекстЗапроса = СтрЗаменить(СтруктураЗагрузкиКаспер.ТекстЗапроса,":"+ПолеОтбора.Ключ,ПолеОтбора.Значение);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ПараметрыЗагрузки.ACC_ID) Тогда
				Если СтрНайти(СтруктураЗагрузкиКаспер.ТекстЗапроса,"where 1 = 1") > 0 Тогда
					ТекстWhere = "where 1 = 1";
					Если ТипЗнч(ПараметрыЗагрузки.ACC_ID) = Тип("Массив") Тогда
						Список_ID_Каспер = "";
						Инд = 0;
						Для каждого ID_Каспер Из ПараметрыЗагрузки.ACC_ID Цикл
							Список_ID_Каспер = Список_ID_Каспер+ Формат(ID_Каспер,"ЧГ=") + ",";
							Инд = Инд + 1;
						КонецЦикла;

						Список_ID_Каспер = Список_ID_Каспер + "***";
						Список_ID_Каспер = СтрЗаменить(Список_ID_Каспер,",***","");

						СтруктураЗагрузкиКаспер.ТекстЗапроса = СтрЗаменить(СтруктураЗагрузкиКаспер.ТекстЗапроса,ТекстWhere,ТекстWhere + " AND "+СтрокаТаблицы.ИмяТаблицы+"."+ПараметрыЗагрузки.РеквизитОтбора+" in ("+Список_ID_Каспер + ")");
							
					Иначе	
						СтруктураЗагрузкиКаспер.ТекстЗапроса = СтрЗаменить(СтруктураЗагрузкиКаспер.ТекстЗапроса,ТекстWhere,ТекстWhere + " AND "+СтрокаТаблицы.ИмяТаблицы+"."+ПараметрыЗагрузки.РеквизитОтбора+" = "+Формат(ПараметрыЗагрузки.ACC_ID,"ЧГ="));
					КонецЕсли;
				Иначе
					ВызватьИсключение "Не удалось найти текст ""where 1 = 1""";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		
	
		ХМ_Оракл = Обработки.ХМ_Оракл64.Создать();
		ТЗ_Каспер = ХМ_Оракл.ОРАКЛ_ЗагрузитьРезультатВТЗ(СтруктураЗагрузкиКаспер.ТекстЗапроса);
		ХМ_Оракл = Неопределено;
		
		СтруктураЗагрузкиКаспер.Вставить("ТЗ",ТЗ_Каспер);
	КонецЦикла;	

	Возврат Истина;

КонецФункции

Процедура ЗагрузкаКлиент_Выполнить(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ДополнительныеПараметры, ЛогОшибок, РезультатЗагрузки)
	
	Перем ГруппаПравилЗагрузки, КЗ_СтруктураЗагрузкиКлиент, СтруктураЗагрузкиКлиент, ТекстЗапроса, ТЧ_ТЗ;
	
	Если СтрокаТаблицы.ТипЗагрузкиКаспер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
		РезультатЗагрузки.ЗагрузкаКлиент = ЗагрузкаКлиент_ВыполнитьПоПравилам(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ДополнительныеПараметры, ЛогОшибок);
	ИначеЕсли СтрокаТаблицы.ТипЗагрузкиКлиент = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоЗапросу Тогда
        РезультатЗагрузки.ЗагрузкаКлиент =  ЗагрузкаКлиент_ВыполнитьПоЗапросу(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ДополнительныеПараметры, ЛогОшибок);
	ИначеЕсли СтрокаТаблицы.ТипЗагрузкиКлиент = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаСКД Тогда
        РезультатЗагрузки.ЗагрузкаКлиент =  ЗагрузкаКлиент_ВыполнитьСКД(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ДополнительныеПараметры, ЛогОшибок);
	КонецЕсли;                                                                      
	РезультатЗагрузки.Результат = Мин(РезультатЗагрузки.Результат,РезультатЗагрузки.ЗагрузкаКлиент);
                                                
КонецПроцедуры

Функция ЗагрузкаКлиент_ВыполнитьПоПравилам(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ДополнительныеПараметры, ЛогОшибок)
	
	Перем ГруппаПравилЗагрузки, КЗ_СтруктураЗагрузкиКлиент, РезультатЗагрузкиЗагрузкаКлиент, СтруктураЗагрузкиКлиент, СтруктураПравилЗагрузкиКаспер, ТекстЗапроса, ТЧ_ТЗ;
	
	Для каждого ГруппаПравилЗагрузки Из ПравилаЗагрузкиКлиент Цикл
		РезультатЗагрузкиЗагрузкаКлиент  = Истина;
		Для каждого КЗ_СтруктураЗагрузкиКлиент Из ГруппаПравилЗагрузки.Значение Цикл
			Если НЕ КЗ_СтруктураЗагрузкиКлиент.Ключ = "Реквизиты"  
				И (ДополнительныеПараметры.Свойство("ТолькоСверкаДанных") ИЛИ ПараметрыЗагрузки.Свойство("ТолькоСверкаДанных")) 
				И (НЕ ДополнительныеПараметры.Свойство("ЗагрузкаПоРезультатамСверки") ИЛИ НЕ ПараметрыЗагрузки.Свойство("ЗагрузкаПоРезультатамСверки")) Тогда
				Продолжить;
			КонецЕсли;

				
			СтруктураЗагрузкиКлиент = КЗ_СтруктураЗагрузкиКлиент.Значение;
			ТЧ_ТЗ = Неопределено;
			СтруктураПравилЗагрузкиКаспер = ПравилаЗагрузкиКаспер[СтруктураЗагрузкиКлиент.Узел.Каспер_Запрос];
			Если Не СтруктураПравилЗагрузкиКаспер.Свойство("ТЗ",ТЧ_ТЗ) ИЛИ ТЧ_ТЗ = Неопределено Тогда
				ТЧ_ТЗ = ЗагрузитьДанные_Сервер(СтруктураПравилЗагрузкиКаспер.ТекстЗапроса,ПараметрыЗагрузки.КаталогОбработки,ПараметрыЗагрузки.Таблица_ХМ_КасперСохраненныйРезультатЗапроса);	
			КонецЕсли;
			Если ТЧ_ТЗ = Неопределено Тогда
				ЛогОшибок.Добавить("ЗагрузкаКлиент_Выполнить: Не удалось получить ТЗ");
				РезультатЗагрузкиЗагрузкаКлиент = Ложь;
				Прервать;
			КонецЕсли;
			Если Не Загрузка_ПроверитьКорректностьПолей(СтруктураЗагрузкиКлиент.Узел, СтруктураЗагрузкиКлиент.Каспер_МаппингРеквизитов, ТЧ_ТЗ, ЛогОшибок, ДополнительныеПараметры) Тогда
				РезультатЗагрузкиЗагрузкаКлиент = Ложь;
				Прервать;
			КонецЕсли;                                                       
			Если КЗ_СтруктураЗагрузкиКлиент.Ключ = "Реквизиты" Тогда
				ТекстЗапроса = Загрузка_ПолучитьТаблицуЗагрузки(СтруктураЗагрузкиКлиент.Узел, СтруктураЗагрузкиКлиент.Каспер_МаппингРеквизитов, ТЧ_ТЗ,ДополнительныеПараметры, ПараметрыЗагрузки);
				ТекстЗапроса = ТекстЗапроса + Символы.ПС + Загрузка_ДополнитьДанными1С(СтруктураЗагрузкиКлиент.С1_МаппингРеквизитов, ТЧ_ТЗ, ДополнительныеПараметры, ПараметрыЗагрузки);
				Если ДополнительныеПараметры.Свойство("ТолькоСверкаДанных") ИЛИ ПараметрыЗагрузки.Свойство("ТолькоСверкаДанных") Тогда
					Загрузка_ВыполнитьСверкуДанных(СтруктураЗагрузкиКлиент.Узел, СтруктураЗагрузкиКлиент.Каспер_МаппингРеквизитов, СтруктураЗагрузкиКлиент.С1_МаппингРеквизитов, ТЧ_ТЗ, ДополнительныеПараметры);
				КонецЕсли;	
			Иначе
				ТекстЗапроса = Загрузка_ПолучитьТаблицуЗагрузки(СтруктураЗагрузкиКлиент.Узел, СтруктураЗагрузкиКлиент.Каспер_МаппингРеквизитов, ТЧ_ТЗ);
				ТекстЗапроса = ТекстЗапроса + Символы.ПС + Загрузка_ДополнитьДанными1С(СтруктураЗагрузкиКлиент.С1_МаппингРеквизитов, ТЧ_ТЗ);
			КонецЕсли;     
			
			Если Ложь Тогда ТЧ_ТЗ = Новый ТаблицаЗначений(); КонецЕсли;
			ТЧ_ТЗ.Индексы.Добавить(СтруктураЗагрузкиКлиент.Узел.Каспер_поле);
			ТЧ_ТЗ.Сортировать(СтруктураЗагрузкиКлиент.Узел.Каспер_поле);
			// ХМНПФ 31.10.2017 ХлопцевБА // Новая хм_ПроверитьВидДвижения() // №1215
			Если КЗ_СтруктураЗагрузкиКлиент.Ключ = "Движения" ИЛИ КЗ_СтруктураЗагрузкиКлиент.Ключ = "ДвиженияПослеПроведения" Тогда
				хм_ПроверитьВидДвижения(СтруктураЗагрузкиКлиент.Узел,ТЧ_ТЗ);
			КонецЕсли;
			СтруктураЗагрузкиКлиент.Вставить("ТЗ", ТЧ_ТЗ);
			СтруктураЗагрузкиКлиент.Вставить("ТекстЗапроса", ТекстЗапроса);
			ЛогОшибок.Добавить(ГруппаПравилЗагрузки.Ключ + ": "+СтруктураЗагрузкиКлиент.МетаданныеЗначения_Имя+": "+ТЧ_ТЗ.Количество());
		КонецЦикла;
		Если РезультатЗагрузкиЗагрузкаКлиент = Ложь Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат РезультатЗагрузкиЗагрузкаКлиент;

КонецФункции

Функция ЗагрузкаКлиент_ВыполнитьПоЗапросу(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ДополнительныеПараметры, ЛогОшибок = Неопределено)
	
	Если Не ПараметрыЗагрузки.Свойство("ACC_ID") Тогда
		ПараметрыЗагрузки.Вставить("ACC_ID",0);
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("РеквизитОтбора") Тогда
		ПараметрыЗагрузки.Вставить("РеквизитОтбора","OPER_ID");
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("PF_ID") Тогда
		ПараметрыЗагрузки.Вставить("PF_ID",0);
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("Построчно") Тогда
		ПараметрыЗагрузки.Вставить("Построчно",Ложь);
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("ЗагрузкаНаПрямую") Тогда
		ПараметрыЗагрузки.Вставить("ЗагрузкаНаПрямую",хм_МеханизмыСверкиСервер.ЗагрузкаНаПрямую(СтрокаТаблицы.ИмяТаблицы));
	КонецЕсли;  
	
	Для каждого КЗ_СтруктураЗагрузкиКлиент Из ПравилаЗагрузкиКлиент Цикл 
 		СтруктураЗагрузкиКлиент = КЗ_СтруктураЗагрузкиКлиент.Значение;

		Если Не СтруктураЗагрузкиКлиент.Свойство("ТекстЗапроса") Тогда
			СтруктураЗагрузкиКлиент.Вставить("ТекстЗапроса");
		КонецЕсли;
		Если Не СтруктураЗагрузкиКлиент.Свойство("Запрос") Тогда
			СтруктураЗагрузкиКлиент.Вставить("Запрос");
		КонецЕсли;

		Если ПараметрыЗагрузки.ЗагрузкаНаПрямую Тогда
			
			Если Не ЗначениеЗаполнено(СтруктураЗагрузкиКлиент.ТекстЗапроса) Тогда
				Если НЕ ЗначениеЗаполнено(СтруктураЗагрузкиКлиент.Запрос) Тогда
					СтруктураЗагрузкиКлиент.Запрос = РегистрыСведений.ХМ_ЗагрузкаКасперV4.ПолучитьТекстЗапросаИзРегистраЗагрузки(СтрокаТаблицы.ИмяТаблицы,ПараметрыЗагрузки.PF_ID, Истина);
				КонецЕсли;

				СтруктураЗагрузкиКлиент.ТекстЗапроса = СтруктураЗагрузкиКлиент.Запрос;
   			
				Если ЗначениеЗаполнено(ПараметрыЗагрузки.ACC_ID) Тогда
					СтруктураЗагрузкиКлиент.ТекстЗапроса = СтрЗаменить(СтруктураЗагрузкиКлиент.ТекстЗапроса,"где"," где ТЗ_Каспер."+ПараметрыЗагрузки.РеквизитОтбора+" = "+Формат(ПараметрыЗагрузки.ACC_ID,"ЧГ=")+" И ");
				КонецЕсли;
			КонецЕсли;

			Запрос = Новый Запрос;
			Запрос.Текст = СтруктураЗагрузкиКлиент.ТекстЗапроса;
			
			Для каждого КЗ_СтруктураЗагрузкиКаспер Из ПравилаЗагрузкиКаспер Цикл 
				Запрос.УстановитьПараметр(КЗ_СтруктураЗагрузкиКаспер.Ключ,КЗ_СтруктураЗагрузкиКаспер.Значение.ТЗ);
			КонецЦикла;
		
			ПоляОтбораЗаписей = хм_МеханизмыСверкиСервер.ПолучитьПоляОтбораЗаписей(СтрокаТаблицы, ПараметрыЗагрузки);
			
			Для каждого ПолеОтбора Из ПоляОтбораЗаписей Цикл
				Запрос.УстановитьПараметр(ПолеОтбора.Ключ,ПолеОтбора.Значение);
			КонецЦикла;
			РезультатЗапроса = Запрос.Выполнить(); 
			ДеревоНаСервере = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			
		ИначеЕсли ПараметрыЗагрузки.Построчно = Ложь  Тогда
			                                                                    
			ВыборкаПериод = Новый Структура();
			
			ПоляОтбораЗаписей = хм_МеханизмыСверкиСервер.ПолучитьПоляОтбораЗаписей(СтрокаТаблицы, ПараметрыЗагрузки);

			Для каждого ПолеОтбора Из ПоляОтбораЗаписей Цикл
				ВыборкаПериод.Вставить(ПолеОтбора.Ключ,ПолеОтбора.Значение);
			КонецЦикла;                    
			ВыборкаПериод.Вставить("Строки",ПравилаЗагрузкиКаспер[КЗ_СтруктураЗагрузкиКлиент.Ключ].ТЗ);
			ВыборкаПериодМассив = Новый Массив();
			ВыборкаПериодМассив.Добавить(ВыборкаПериод);
			ДеревоНаСервере = Новый Структура();
			
			ДеревоНаСервере.Вставить("Строки",ВыборкаПериодМассив);
			
		КонецЕсли;

		СтруктураЗагрузкиКлиент.Вставить("ТЗ",ДеревоНаСервере);
	КонецЦикла;	

	Возврат Истина;

КонецФункции

Функция ЗагрузкаКлиент_ВыполнитьСКД(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ДополнительныеПараметры, ЛогОшибок = Неопределено)

	Для каждого СтрокаПравил Из ПравилаЗагрузкиКлиент Цикл 
		СтрокаПравилКлиент = СтрокаПравил.Значение; 
		СКД = Неопределено;
		Если ЗначениеЗаполнено(СтрокаПравилКлиент.СКД) Тогда
			СКД = ЗначениеИзСтрокиВнутр(СтрокаПравилКлиент.СКД);
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("С1_ВернутьТаблицы1С") Тогда
			СтрокаПравилКлиент.Вставить("ТипВозвращаеммогоЗначения","ТабличныйДокумент");
		КонецЕсли;
		
		ОбъектВывода = хм_МеханизмыСверкиСервер.СформироватьДеревоНаСервере(СКД, СтрокаПравилКлиент, ПараметрыЗагрузки , ПараметрыЗагрузки);
		СтрокаПравилКлиент.Вставить("ТЗ",ОбъектВывода);
	КонецЦикла;	
		
	Возврат Истина; 
	
КонецФункции

Функция ЗагрузкаКаспер_ВыполнитьСКД(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ДополнительныеПараметры, ЛогОшибок = Неопределено)
	
	Для каждого СтрокаПравил Из ПравилаЗагрузкиКаспер Цикл 
		СтрокаПравилКлиент = СтрокаПравил.Значение; 
		СКД = Неопределено;
		Если ЗначениеЗаполнено(СтрокаПравилКлиент.СКД) Тогда
			СКД = ЗначениеИзСтрокиВнутр(СтрокаПравилКлиент.СКД);
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("Каспер_ВернутьРезультатыЗапроса") Тогда
			СтрокаПравилКлиент.Вставить("ТипВозвращаеммогоЗначения","ТабличныйДокумент");
		КонецЕсли;

		Если СтрокаПравилКлиент.Свойство("ТипВозвращаеммогоЗначения") = Ложь Тогда
			СтрокаПравилКлиент.Вставить("ТипВозвращаеммогоЗначения","ТаблицаЗначений");	
		КонецЕсли;
		
		ОбъектВывода = хм_МеханизмыСверкиСервер.СформироватьДеревоНаСервере(СКД, СтрокаПравилКлиент, ПараметрыЗагрузки , ПараметрыЗагрузки);
		СтрокаПравилКлиент.Вставить("ТЗ",ОбъектВывода);
	КонецЦикла;	
		
	Возврат Истина; 
	
КонецФункции

Процедура ЗагрузкаСервер_Выполнить(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок, РезультатЗагрузки)
	Если СтрокаТаблицы.ТипЗагрузкиСервер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
		РезультатЗагрузки.ЗагрузкаСервер = ХМ_ЗагрузкаТЗ_Сервер.ЗагрузитьПоТаблицамИзКлиента(СтрокаТаблицы, ПравилаЗагрузкиКлиент, ПараметрыЗагрузки, ЛогОшибок, ДополнительныеПараметры);
	ИначеЕсли СтрокаТаблицы.ТипЗагрузкиСервер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.УниверсальнаяЗагрузкаВРегистр Тогда
		РезультатЗагрузки.ЗагрузкаСервер = ЗагрузкаСервер_ВыполнитьУниверсальнаяВРегистр(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок)	
		///	
	ИначеЕсли СтрокаТаблицы.ТипЗагрузкиСервер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ПроцедурнаяЗагрузка	Тогда
		РезультатЗагрузки.ЗагрузкаСервер = ЗагрузкаСервер_ВыполнитьПроцедурная(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок)	
	Иначе
	КонецЕсли;
	РезультатЗагрузки.Результат = РезультатЗагрузки.ЗагрузкаСервер;
КонецПроцедуры

Функция ЗагрузкаСервер_ВыполнитьУниверсальнаяВРегистр(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок = Неопределено)
	                          
	Перем ПараметрыСтарая;
	
	Если Не ПараметрыЗагрузки.Свойство("ACC_ID") Тогда
		ПараметрыЗагрузки.Вставить("ACC_ID",0);
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("РеквизитОтбора") Тогда
		ПараметрыЗагрузки.Вставить("РеквизитОтбора","OPER_ID");
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("PF_ID") Тогда
		ПараметрыЗагрузки.Вставить("PF_ID",0);
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("Построчно") Тогда
		ПараметрыЗагрузки.Вставить("Построчно",Ложь);
	КонецЕсли;
	Если Не ПараметрыЗагрузки.Свойство("ЗагрузкаНаПрямую") Тогда
		ПараметрыЗагрузки.Вставить("ЗагрузкаНаПрямую",хм_МеханизмыСверкиСервер.ЗагрузкаНаПрямую(СтрокаТаблицы.ИмяТаблицы));
	КонецЕсли;  
 
	ПоляОтбораЗаписей = хм_МеханизмыСверкиСервер.ПолучитьПоляОтбораЗаписей(СтрокаТаблицы, ПараметрыЗагрузки);

	Для каждого КЗ_СтруктураЗагрузкиКлиент Из ПравилаЗагрузкиКлиент Цикл 
 		СтруктураЗагрузкиКлиент = КЗ_СтруктураЗагрузкиКлиент.Значение; 

		ТЗ_Каспер =  СтруктураЗагрузкиКлиент.ТЗ;
		
		Если (ПараметрыЗагрузки.ЗагрузкаНаПрямую ИЛИ ПараметрыЗагрузки.Построчно = Ложь) И НЕ ТипЗнч(ПараметрыЗагрузки.ACC_ID) = Тип("Массив") Тогда
			//РезультатЗапроса.выгрузить()[1]
			Для каждого ВыборкаПериод Из ТЗ_Каспер.Строки Цикл
				НЗ = РегистрыСведений[СтрокаТаблицы.ИмяТаблицы].СоздатьНаборЗаписей();
				
				Для каждого ПолеОтбора Из ПоляОтбораЗаписей Цикл
					Попытка
						НЗ.Отбор[ПолеОтбора.Ключ].Установить(ВыборкаПериод[ПолеОтбора.Ключ]);
					Исключение
						Сообщить("При установке отбора регистра: "+ОписаниеОшибки());
					КонецПопытки;
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ПараметрыЗагрузки.ACC_ID) Тогда
					НЗ.Отбор[ПараметрыЗагрузки.РеквизитОтбора].Установить(ПараметрыЗагрузки.ACC_ID);
				КонецЕсли;
				Для каждого Выборка Из ВыборкаПериод.Строки Цикл
					СтрокаНЗ = НЗ.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНЗ,Выборка);
				КонецЦикла;
				НЗ.ОбменДанными.Загрузка = Истина;
				НЗ.Записать();
				НЗ = Неопределено;
			КонецЦикла;
			Выборка = Неопределено;
			ВыборкаПериод = Неопределено;
			РезультатЗапроса = Неопределено;
		ИначеЕсли (ПараметрыЗагрузки.ЗагрузкаНаПрямую ИЛИ ПараметрыЗагрузки.Построчно = Ложь) И ТипЗнч(ПараметрыЗагрузки.ACC_ID) = Тип("Массив") Тогда
					
			Для каждого ВыборкаПериод Из ТЗ_Каспер.Строки Цикл
				Для каждого ACC_ID ИЗ ПараметрыЗагрузки.ACC_ID Цикл
					НЗ = РегистрыСведений[СтрокаТаблицы.ИмяТаблицы].СоздатьНаборЗаписей();
					Для каждого ПолеОтбора Из ПоляОтбораЗаписей Цикл
						Попытка
							НЗ.Отбор[ПолеОтбора.Ключ].Установить(ВыборкаПериод[ПолеОтбора.Ключ]);
						Исключение
							Сообщить("При установке отбора регистра: "+ОписаниеОшибки());
						КонецПопытки;
					КонецЦикла;
					НЗ.Отбор[ПараметрыЗагрузки.РеквизитОтбора].Установить(ACC_ID); 
					НЗ.ОбменДанными.Загрузка = Истина;
					НЗ.Записать();
					НЗ = Неопределено;
				КонецЦикла;

				Для каждого Строка_ТЗ Из ВыборкаПериод.Строки Цикл
					МЗ = РегистрыСведений[СтрокаТаблицы.ИмяТаблицы].СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МЗ,Строка_ТЗ);
					МЗ.Записать();
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе	
			
			Для каждого Строка_ТЗ Из ТЗ_Каспер Цикл
				МЗ = РегистрыСведений[СтрокаТаблицы.ИмяТаблицы].СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ,Строка_ТЗ);
				МЗ.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

Функция ЗагрузкаСервер_ВыполнитьПроцедурная(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок = Неопределено)
	
	Для каждого СтрокаПравил Из ПравилаЗагрузкиСервер Цикл
		
		СтрокаПравилСервер = СтрокаПравил.Значение;
		ИмяПроцедуры = СтрокаПравилСервер.ИмяПроцедуры;
		ДеревоНаСервере = Неопределено;
		Если ЗначениеЗаполнено(СтрокаПравилСервер.ИмяТЗ) Тогда
			СтрокаПравилКлиент = ПравилаЗагрузкиКлиент[СтрокаПравилСервер.ИмяТЗ];
			СтрокаПравилКлиент.Свойство("ТЗ",ДеревоНаСервере);                    
		КонецЕсли;
		
		ОперацияНПО = СтрокаПравилСервер.ОперацияНПО;
		Выполнить(ИмяПроцедуры + "(ДеревоНаСервере, ОперацияНПО, СтрокаПравилСервер)");
	КонецЦикла;
	Возврат Истина;	
КонецФункции 

Функция ПередВозвратомРезультата(СтрокаТаблицы,РезультатЗагрузки,ДополнительныеПараметры, ПравилаЗагрузкиКаспер = Неопределено,ПравилаЗагрузкиКлиент = Неопределено)
	Если ДополнительныеПараметры.Свойство("СтрокаТаблицы") Тогда
		ДополнительныеПараметры.Вставить("СтрокаТаблицы",Неопределено);
	КонецЕсли; 
	Если Не ПравилаЗагрузкиКлиент = Неопределено Тогда
		Если СтрокаТаблицы.ТипЗагрузкиКаспер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
			Для каждого ГруппаПравилЗагрузки Из ПравилаЗагрузкиКлиент Цикл
				Для каждого КЗ_СтруктураЗагрузки Из ГруппаПравилЗагрузки.Значение Цикл
					СтруктураЗагрузкиКлиент = КЗ_СтруктураЗагрузки.Значение;
					Если СтруктураЗагрузкиКлиент.Свойство("ТЗ") Тогда
						СтруктураЗагрузкиКлиент.Удалить("ТЗ");           
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		Иначе
			Для каждого КЗ_СтруктураЗагрузки Из ПравилаЗагрузкиКлиент Цикл
				СтруктураЗагрузки = КЗ_СтруктураЗагрузки.Значение;
				Если СтруктураЗагрузки.Свойство("ТЗ") Тогда
					СтруктураЗагрузки.Удалить("ТЗ");           
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 
	Если Не ПравилаЗагрузкиКаспер = Неопределено Тогда
		Для каждого КЗ_СтруктураЗагрузки Из ПравилаЗагрузкиКаспер Цикл
			СтруктураЗагрузки = КЗ_СтруктураЗагрузки.Значение;
			Если СтруктураЗагрузки.Свойство("ТЗ") Тогда
				СтруктураЗагрузки.Удалить("ТЗ");           
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 

	Возврат РезультатЗагрузки;
КонецФункции

&Вместо("ПолучитьЕЖ")
Функция ХМПолучитьЕЖ(Знач ТипЗагрузки)
 	Если ТипЗагрузки = Неопределено Тогда
		ТипЗагрузки = "";
		//+ХМНПФ 25.05.2020  Хлопцев Б.А. //  № 2767 В свойствах модуля снят признак "Упр.клиент" установлен признак  "Сервер"// ВвестиСтроку(ТипЗагрузки) закрыта #Если ТолстыйКлиентОбычноеПриложение Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ВвестиСтроку(ТипЗагрузки);
		#Иначе
			//В упр. приложении диалог нужно делать до процедуры
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Перезапустите программу в режиме ""Обычное приложение""";
			Сообщение.Сообщить();
		#КонецЕсли
		//+ХМНПФ 25.05.2020  Хлопцев Б.А. //  № 2767 В свойствах модуля снят признак "Упр.клиент" установлен признак  "Сервер"
	КонецЕсли;

	ХМ_ЕжедневнаяЗагрузка = ПолучитьПослюднююЕЖ(ТипЗагрузки);

	Если ХМ_ЕжедневнаяЗагрузка = Неопределено Тогда
		ЕЖ = Документы.ХМ_ЕжедневнаяЗагрузка.СоздатьДокумент();
		ЕЖ.УстановитьНовыйНомер();
		ЕЖ.Дата = ТекущаяДата();
		ЕЖ.ТипЗагрузки = ТипЗагрузки; 
		ЕЖ.Записать();
		ХМ_ЕжедневнаяЗагрузка = ЕЖ.Ссылка;
	КонецЕсли;
	Если Ложь Тогда ХМ_ЕжедневнаяЗагрузка = Документы.ХМ_ЕжедневнаяЗагрузка.НайтиПоНомеру(""); КонецЕсли;

	Если ХМ_ЕжедневнаяЗагрузка.Проведен Тогда
		Если ХМ_ЕжедневнаяЗагрузка.ЕжемесячнаяЗагрузка И ХМ_ЕжедневнаяЗагрузка.ВыполняетсяОбмен Тогда
			//Не переходим на следующий месяц, оставляем как есть
			//ВыполняетсяОбмен значит есть ошибки в обмене.
		Иначе		
			ЕЖ = ХМ_ЕжедневнаяЗагрузка.Скопировать();
			ХМ_ЕжедневнаяЗагрузка = ПолучитьПослюднююЕЖ(ТипЗагрузки);
		КонецЕсли;
	КонецЕсли;              

	Возврат ХМ_ЕжедневнаяЗагрузка; 

КонецФункции

Функция ПолучитьВозможныеТипыЗагрузки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХМ_ЕжедневнаяЗагрузка.ТипЗагрузки КАК ТипЗагрузки
		|ИЗ
		|	Документ.ХМ_ЕжедневнаяЗагрузка КАК ХМ_ЕжедневнаяЗагрузка
		|ГДЕ
		|	ХМ_ЕжедневнаяЗагрузка.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТипЗагрузки");
КонецФункции

Функция Загрузка_ДополнитьДанными1С(МаппингРеквизитов_1С, ТЗ, ДополнительныеПараметры = Неопределено, ПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;
	Если ПараметрыЗагрузки = Неопределено Тогда
		ПараметрыЗагрузки = Новый Структура();
	КонецЕсли;

	Если МаппингРеквизитов_1С.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	ЗапросПреобразования = Новый Запрос();
	ЗапросПреобразования.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросПреобразования.УстановитьПараметр("ТЗВходящиеДанные",ТЗ);
		
	ЗапросПреобразования.Текст = 
	"ВЫБРАТЬ
	|	ТЗВходящиеДанные.*
	|ПОМЕСТИТЬ ТЗВходящиеДанные
	|ИЗ
	|	&ТЗВходящиеДанные КАК ТЗВходящиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	| ВходящиеДанные.*, %текстВыбрать%
	|ИЗ
	|	ТЗВходящиеДанные КАК ВходящиеДанные %текстЛевоеСоединение%";
	текстВыбрать = "";
	текстЛевоеСоединение = "";

	Если ДополнительныеПараметры.Свойство("ТолькоСверкаДанных") ИЛИ ПараметрыЗагрузки.Свойство("ТолькоСверкаДанных") Тогда
		Объект_Путь = "ВходящиеДанные." + ДополнительныеПараметры.Объект_Имя;
		Объект_Путь = "ВЫРАЗИТЬ("+Объект_Путь+" КАК "+ПолучитьМетаТип_по_ТипОбъекта(ДополнительныеПараметры.СтрокаТаблицы.ТипОбъекта)+ДополнительныеПараметры.СтрокаТаблицы.ИмяТаблицы + ")";
		Объект_Имя 	= ДополнительныеПараметры.Объект_Имя;                                             
		МассивРеквизитов = ПолучитьМассивИменРеквизитов(ДополнительныеПараметры.СтрокаТаблицы);
	КонецЕсли;

	СоответствиеЗапросов1С = Новый Соответствие();
	Для каждого СтрокаРеквизита Из МаппингРеквизитов_1С Цикл
		СтруктураРеквизита = СтрокаРеквизита.Значение;
		Если ЗначениеЗаполнено(СтруктураРеквизита.Каспер_Запрос) Тогда
			Таблица1С = СоответствиеЗапросов1С.Получить(СтруктураРеквизита.Каспер_Запрос);
			Если Таблица1С = Неопределено Тогда
				Таблица1С = "Таблица1С"+СоответствиеЗапросов1С.Количество();
				СоответствиеЗапросов1С.Вставить(СтруктураРеквизита.Каспер_Запрос,Таблица1С);
				ЛевоеСоединение = "	
				|		ЛЕВОЕ СОЕДИНЕНИЕ "+СтруктураРеквизита.Каспер_Запрос+" КАК "+Таблица1С+"
				|		ПО "+СтруктураРеквизита.Каспер_Условие;
				ЛевоеСоединение = СтрЗаменить(ЛевоеСоединение,"%%",Таблица1С);
				текстЛевоеСоединение = текстЛевоеСоединение + ЛевоеСоединение;
			КонецЕсли;
			текстВыбрать = текстВыбрать + СтрЗаменить(СтруктураРеквизита.Каспер_поле,"%%",Таблица1С) + " КАК "+СтруктураРеквизита.Имя+", ";	
		Иначе
			текстВыбрать = текстВыбрать + СтруктураРеквизита.Каспер_поле + " КАК "+СтруктураРеквизита.Имя+", ";	
		КонецЕсли;

		Если ДополнительныеПараметры.Свойство("ТолькоСверкаДанных") ИЛИ ПараметрыЗагрузки.Свойство("ТолькоСверкаДанных") Тогда
			Если Не МассивРеквизитов.Найти(СтруктураРеквизита.Имя) = Неопределено Тогда
				текстВыбрать = текстВыбрать + Объект_Путь + "." + СтруктураРеквизита.Имя+ " КАК "+Объект_Имя+"_"+СтруктураРеквизита.Имя+", ";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	текстВыбрать = СтрЗаменить(текстВыбрать+"№",", №","");
	ЗапросПреобразования.Текст = СтрЗаменить(ЗапросПреобразования.Текст,"%текстВыбрать%",текстВыбрать);	
	ЗапросПреобразования.Текст = СтрЗаменить(ЗапросПреобразования.Текст,"%текстЛевоеСоединение%",текстЛевоеСоединение);	
	РезультатЗапроса = ЗапросПреобразования.Выполнить();
	ТекстЗапроса = ЗапросПреобразования.Текст;
	ТЗ = Неопределено;
	ТЗ = РезультатЗапроса.Выгрузить();
	ЗапросПреобразования = Неопределено;
	РезультатЗапроса = Неопределено;
	Возврат ТекстЗапроса;
КонецФункции

Функция Загрузка_ПолучитьТаблицуЗагрузки(Реквизиты_УЗЕЛ, МаппингРеквизитов, ТЗ, ДополнительныеПараметры = Неопределено, ПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;
 	Если ПараметрыЗагрузки = Неопределено Тогда
		ПараметрыЗагрузки = Новый Структура();
	КонецЕсли;

	ЗапросПреобразования = Новый Запрос();
	ЗапросПреобразования.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросПреобразования.УстановитьПараметр("ТЗВходящиеДанные",ТЗ);
		
	ЗапросПреобразования.Текст = 
	"ВЫБРАТЬ
	|	ТЗВходящиеДанные.*
	|ПОМЕСТИТЬ ТЗВходящиеДанные
	|ИЗ
	|	&ТЗВходящиеДанные КАК ТЗВходящиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	| %текстВыбрать%
	|ИЗ
	|	ТЗВходящиеДанные КАК ВходящиеДанные %текстЛевоеСоединение%";
	текстВыбрать = "";
	текстЛевоеСоединение = "";
	
	РесурсИмя = "";
	СтрокаРеквизита = Новый Структура;
	СтрокаРеквизита.Вставить("Имя",Реквизиты_УЗЕЛ.Имя);
	СтрокаРеквизита.Вставить("Каспер_поле",Реквизиты_УЗЕЛ.Каспер_поле);
	СтрокаРеквизита.Вставить("Тип","");
	СтрокаРеквизита.Вставить("Каспер_условие","");
	Каспер_Поле_Тип =  Строка(ТЗ.Колонки[Реквизиты_УЗЕЛ.Каспер_поле].ТипЗначения.Типы()[0]);
	ЛевоеСоединение = ПолучитьЛевоеСоединение(СтрокаРеквизита,Реквизиты_УЗЕЛ.Тип,РесурсИмя,Каспер_Поле_Тип,Реквизиты_УЗЕЛ.Каспер_Условие);
	текстЛевоеСоединение = текстЛевоеСоединение + ЛевоеСоединение;
	текстВыбрать = текстВыбрать + ""+Реквизиты_УЗЕЛ.Тип+?(ЗначениеЗаполнено(Реквизиты_УЗЕЛ.Каспер_Условие),Реквизиты_УЗЕЛ.Каспер_Условие,СтрокаРеквизита.Имя)+"."+РесурсИмя+" КАК "+РесурсИмя+", ";
	текстВыбрать = текстВыбрать + "ВходящиеДанные."+Реквизиты_УЗЕЛ.Каспер_поле+" КАК "+Реквизиты_УЗЕЛ.Каспер_поле+", ";	

	Если ДополнительныеПараметры.Свойство("ТолькоСверкаДанных") ИЛИ ПараметрыЗагрузки.Свойство("ТолькоСверкаДанных") Тогда
		Объект_Путь = ""+Реквизиты_УЗЕЛ.Тип+СтрокаРеквизита.Имя+"."+РесурсИмя;
		Объект_Путь = "ВЫРАЗИТЬ("+Объект_Путь+" КАК "+ПолучитьМетаТип_по_ТипОбъекта(ДополнительныеПараметры.СтрокаТаблицы.ТипОбъекта)+ДополнительныеПараметры.СтрокаТаблицы.ИмяТаблицы + ")";
		Объект_Имя 	= РесурсИмя;                                             
		МассивРеквизитов = ПолучитьМассивИменРеквизитов(ДополнительныеПараметры.СтрокаТаблицы);
	КонецЕсли;

	
	Для каждого СтрокаРеквизита Из МаппингРеквизитов Цикл
		СтруктураРеквизита = СтрокаРеквизита.Значение;
		Каспер_Поле_Тип =  Строка(ТЗ.Колонки[СтруктураРеквизита.Каспер_поле].ТипЗначения.Типы()[0]);
		Если СтруктураРеквизита.Каспер_Условие = "ХМ_КасперПростые" Тогда
			ИмяРегистраСведений = "ХМ_КасперПростые";
			РесурсИмя = "Значение";
			ЛевоеСоединение = ПолучитьЛевоеСоединение(СтруктураРеквизита,ИмяРегистраСведений,РесурсИмя,Каспер_Поле_Тип);
			текстЛевоеСоединение = текстЛевоеСоединение + ЛевоеСоединение;
			текстВыбрать = текстВыбрать + ИмяРегистраСведений +СтруктураРеквизита.Имя+"."+РесурсИмя+" КАК "+СтруктураРеквизита.Имя+", ";	
			
		ИначеЕсли СтруктураРеквизита.Тип = "Дата"
			ИЛИ СтруктураРеквизита.Тип = "Строка"
			ИЛИ СтруктураРеквизита.Тип = "Число"
			ИЛИ СтруктураРеквизита.Тип = "Булево" Тогда
			текстВыбрать = текстВыбрать + "ВходящиеДанные."+СтруктураРеквизита.Каспер_поле+" КАК "+СтруктураРеквизита.Имя+", ";
		ИначеЕсли Найти(СтруктураРеквизита.Тип,".")>0 Тогда
			ИмяПоля1С = "";
			Если ЗначениеЗаполнено(СтруктураРеквизита.Каспер_Условие) Тогда
				ИмяРегистраСведений = СтруктураРеквизита.Каспер_Условие;
			Иначе
				СтрокаМаппинга = СтруктураРеквизита.СтрокаВидаОбъекта;
				Если Не СтрокаМаппинга = Неопределено Тогда
					ИмяРегистраСведений = СтрокаМаппинга.Тип;
					ИмяПоля1С = СтрокаМаппинга.Каспер_Условие;
				КонецЕсли;
			КонецЕсли;

			Если ИмяРегистраСведений = Неопределено Тогда
				Вызватьисключение "Данный тип не обрабатывается";
			КонецЕсли;		
			РесурсИмя = "";
			ЛевоеСоединение = ПолучитьЛевоеСоединение(СтруктураРеквизита,ИмяРегистраСведений,РесурсИмя,Каспер_Поле_Тип,ИмяПоля1С);
			текстЛевоеСоединение = текстЛевоеСоединение + ЛевоеСоединение;
			текстВыбрать = текстВыбрать + ИмяРегистраСведений +СтруктураРеквизита.Имя+"."+РесурсИмя+" КАК "+СтруктураРеквизита.Имя+", ";	
		Иначе
			Вызватьисключение "Не определеннный тип данных";
		КонецЕсли;

		Если (ДополнительныеПараметры.Свойство("ТолькоСверкаДанных") ИЛИ ПараметрыЗагрузки.Свойство("ТолькоСверкаДанных")) И НЕ СтруктураРеквизита.Имя = "ПропуститьНовыйДокумент" Тогда
			Если Не МассивРеквизитов.Найти(СтруктураРеквизита.Имя) = Неопределено Тогда
				текстВыбрать = текстВыбрать + Объект_Путь + "." + СтруктураРеквизита.Имя+ " КАК "+Объект_Имя+"_"+СтруктураРеквизита.Имя+", ";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	текстВыбрать = СтрЗаменить(текстВыбрать+"№",", №","");
	ЗапросПреобразования.Текст = СтрЗаменить(ЗапросПреобразования.Текст,"%текстВыбрать%",текстВыбрать);	
	ЗапросПреобразования.Текст = СтрЗаменить(ЗапросПреобразования.Текст,"%текстЛевоеСоединение%",текстЛевоеСоединение);	
	РезультатЗапроса = ЗапросПреобразования.Выполнить();
	ТекстЗапроса = ЗапросПреобразования.Текст;
	ТЗ = Неопределено;
	ТЗ = РезультатЗапроса.Выгрузить();
	ЗапросПреобразования = Неопределено;
	РезультатЗапроса = Неопределено;
	Возврат ТекстЗапроса;
КонецФункции


Функция Загрузка_ВыполнитьСверкуДанных(Реквизиты_УЗЕЛ, МаппингРеквизитов, МаппингРеквизитов_1С, ТЗ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;

	ЗапросПреобразования = Новый Запрос();
	ЗапросПреобразования.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросПреобразования.УстановитьПараметр("ТЗВходящиеДанные",ТЗ);
		
	ЗапросПреобразования.Текст = 
	"ВЫБРАТЬ
	|	ТЗВходящиеДанные.*
	|ПОМЕСТИТЬ ТЗВходящиеДанные
	|ИЗ
	|	&ТЗВходящиеДанные КАК ТЗВходящиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	| ВходящиеДанные.*
	|ИЗ
	|	ТЗВходящиеДанные КАК ВходящиеДанные 
	|ГДЕ
	|	ЛОЖЬ %текстГде%";
	текстГде = "";
	
	Объект_Имя = ДополнительныеПараметры.Объект_Имя;

	текстГде = текстГде + " ИЛИ " + Объект_Имя + " ЕСТЬ NULL ";
    текстГде = текстГде + " ИЛИ НЕ " + Объект_Имя + " Ссылка " + ПолучитьМетаТип_по_ТипОбъекта(ДополнительныеПараметры.СтрокаТаблицы.ТипОбъекта)+ДополнительныеПараметры.СтрокаТаблицы.ИмяТаблицы;
	МассивРеквизитов = ПолучитьМассивИменРеквизитов(ДополнительныеПараметры.СтрокаТаблицы);

	Для каждого СтрокаРеквизита Из МаппингРеквизитов Цикл
		СтруктураРеквизита = СтрокаРеквизита.Значение;
		Если СтруктураРеквизита.Имя = "ПропуститьНовыйДокумент" Тогда
			Продолжить;
		КонецЕсли;
		Если МассивРеквизитов.Найти(СтруктураРеквизита.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		Если СтруктураРеквизита.Тип = "Строка" И ЗначениеЗаполнено(СтруктураРеквизита.Длина) Тогда
			текстГде = текстГде + " ИЛИ НЕ ВЫРАЗИТЬ(ВходящиеДанные." + СтруктураРеквизита.Имя + " КАК СТРОКА("+Формат(СтруктураРеквизита.Длина,"ЧГ=")+")) = ВходящиеДанные." + Объект_Имя + "_" + СтруктураРеквизита.Имя;
		ИначеЕсли СтруктураРеквизита.Тип = "Строка" Тогда
			текстГде = текстГде + " ИЛИ НЕ ВЫРАЗИТЬ(ВходящиеДанные." + СтруктураРеквизита.Имя + " КАК СТРОКА(1000)) = ВЫРАЗИТЬ(ВходящиеДанные." + Объект_Имя + "_" + СтруктураРеквизита.Имя + " КАК СТРОКА(1000))";
		ИначеЕсли СтруктураРеквизита.Тип = "Дата"  Тогда
			текстГде = текстГде + " ИЛИ НЕ НАЧАЛОПЕРИОДА(ВходящиеДанные." + СтруктураРеквизита.Имя + ", День) = НАЧАЛОПЕРИОДА(ВходящиеДанные." + Объект_Имя + "_" + СтруктураРеквизита.Имя+", День)";
		Иначе
			текстГде = текстГде + " ИЛИ НЕ ВходящиеДанные." + СтруктураРеквизита.Имя + " = ВходящиеДанные." + Объект_Имя + "_" + СтруктураРеквизита.Имя;
		КонецЕсли

	КонецЦикла;

	СоответствиеЗапросов1С = Новый Соответствие();
	Для каждого СтрокаРеквизита Из МаппингРеквизитов_1С Цикл
		СтруктураРеквизита = СтрокаРеквизита.Значение;
		Если МассивРеквизитов.Найти(СтруктураРеквизита.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если СтруктураРеквизита.Тип = "Строка" И ЗначениеЗаполнено(СтруктураРеквизита.Длина) Тогда
			текстГде = текстГде + " ИЛИ НЕ ВЫРАЗИТЬ(ВходящиеДанные." + СтруктураРеквизита.Имя + " КАК СТРОКА("+Формат(СтруктураРеквизита.Длина,"ЧГ=")+")) = ВходящиеДанные." + Объект_Имя + "_" + СтруктураРеквизита.Имя;
		ИначеЕсли СтруктураРеквизита.Тип = "Строка" Тогда
			текстГде = текстГде + " ИЛИ НЕ ВЫРАЗИТЬ(ВходящиеДанные." + СтруктураРеквизита.Имя + " КАК СТРОКА(1000)) = ВЫРАЗИТЬ(ВходящиеДанные." + Объект_Имя + "_" + СтруктураРеквизита.Имя + " КАК СТРОКА(1000))";
		ИначеЕсли СтруктураРеквизита.Тип = "Дата"  Тогда
			текстГде = текстГде + " ИЛИ НЕ НАЧАЛОПЕРИОДА(ВходящиеДанные." + СтруктураРеквизита.Имя + ", День) = НАЧАЛОПЕРИОДА(ВходящиеДанные." + Объект_Имя + "_" + СтруктураРеквизита.Имя+", День)";
		Иначе
			текстГде = текстГде + " ИЛИ НЕ ВходящиеДанные." + СтруктураРеквизита.Имя + " = ВходящиеДанные." + Объект_Имя + "_" + СтруктураРеквизита.Имя;
		КонецЕсли
	КонецЦикла;
	
//	текстГде = СтрЗаменить(текстГде+"№",", №","");
	ЗапросПреобразования.Текст = СтрЗаменить(ЗапросПреобразования.Текст,"%текстГде%",текстГде);	
	РезультатЗапроса = ЗапросПреобразования.Выполнить();
	ТекстЗапроса = ЗапросПреобразования.Текст;
	ТЗ = Неопределено;
	ТЗ = РезультатЗапроса.Выгрузить();
	ЗапросПреобразования = Неопределено;
	РезультатЗапроса = Неопределено;
	Возврат ТекстЗапроса;
КонецФункции
